<a href="https://colab.research.google.com/github/kimsang-kyu/Python_application/blob/main/20200413_%ED%96%89%2C%EC%97%B4%EC%B6%94%EA%B0%80.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

###행추가
 > a1, a2 ,a3의 변수가 같을경우 밑으로 붙일 수 있음

###pandas.concat()

In [ ]:
data_file = "http://youngho.iwinv.net/data/data_handling.xlsx"
data_excel = pd.ExcelFile(data_file) 
#예전에는 시트네임까지 불러옴, 하지만 경로만 불러오고 몇개의 시트가 있는지 모름
#그래서 ExcelFile이란 코드를 씀

In [ ]:
data_excel.sheet_names
#엑셀 시트에 있는 모든 이름을 보여줌

['a', 'b', 'c', 'd']

In [ ]:
data_a = data_excel.parse('a')
#특정시트의 값을 불러오고 싶을 때
data_a

   a1 a2     a3
0   1  a   1200
1   2  b   4500
2   3  c  10000
3   4  d   9600
4   5  e    150

In [ ]:
data_b = data_excel.parse('b')
data_c = data_excel.parse('c')
data_d = data_excel.parse('d')

data_b

   b1 b2    b3
0   6  f  4600
1   7  g  9850

In [ ]:
frames = [data_a,data_b]
pd.concat(frames) 
#다른이름이기때문에 옆에 변수를 만들어 추가를 해줌
#a에있는 컬럼과 b에있는 컬럼이 같다면 밑으로 붙음

    a1   a2       a3   b1   b2      b3
0  1.0    a   1200.0  NaN  NaN     NaN
1  2.0    b   4500.0  NaN  NaN     NaN
2  3.0    c  10000.0  NaN  NaN     NaN
3  4.0    d   9600.0  NaN  NaN     NaN
4  5.0    e    150.0  NaN  NaN     NaN
0  NaN  NaN      NaN  6.0    f  4600.0
1  NaN  NaN      NaN  7.0    g  9850.0

In [ ]:
nue_col_names = ['no','name','balance']
data_a.columns = nue_col_names
data_b.columns = nue_col_names
data_b
pd.concat([data_a,data_b]) #완성!

   no name  balance
0   1    a     1200
1   2    b     4500
2   3    c    10000
3   4    d     9600
4   5    e      150
0   6    f     4600
1   7    g     9850

In [ ]:
### 기존 행 인덱스 무시
pd.concat([data_a,data_b], ignore_index=True)

   no name  balance
0   1    a     1200
1   2    b     4500
2   3    c    10000
3   4    d     9600
4   5    e      150
5   6    f     4600
6   7    g     9850

###DataFrame.append() - Skip!!!

연습문제

In [ ]:
data_file = "http://youngho.iwinv.net/data/power_station.xlsx"
data_excel = pd.ExcelFile(data_file)

In [ ]:
data_excel.sheet_names

['2014년', '2015년', '2016년', '2017년', '2018년']

In [ ]:
data_2014 = data_excel.parse('2014년')
data_2015 = data_excel.parse('2015년')
data_2016 = data_excel.parse('2016년')
data_2017 = data_excel.parse('2017년')
data_2018 = data_excel.parse('2018년')

In [ ]:
data_power = pd.concat([data_2014,data_2015,data_2016,data_2017,data_2018])
data_power.shape

(1827, 28)

In [ ]:
#"사람들이 이해할 수 있는 코드가 좋다!"

In [ ]:
#많은 양의 시트를 합칠때 쓰면 유용한 코드!
data_power = data_excel.parse(data_excel.sheet_names[0])
for i in data_excel.sheet_names[1:]:
  data_power = pd.concat([data_power, data_excel.parse(i)], ignore_index = True)
data_power

### 데이터프레임 열 추가(변수 추가)

In [ ]:
#분석을 할 때, 태양이 많이 들어와야 많이 생산이 됨 흐리날이였다, 맑은날보다 적게 생산됨
#비가 눈이 오는날이여도 적게 생산됨 그래서 태양광 이 발전량에는 날씨가 굉장히 중요한 역할을 함
#제대로 예측을 하려면 날씨가 큰 영향을 주니 날씨데이터를 옆에 붙여줌
#그러면 추정이 가능함(태양광데이터 + 날씨변수) 
#태양광에 있는 날짜와 날씨에 있는 날짜가 같아야된다.
#기온도 중요! 그럼 또 옆에 기온을 붙이면 된다.

In [ ]:
data_file = "http://youngho.iwinv.net/data/data_handling.xlsx"
data_excel = pd.ExcelFile(data_file) 
data_excel.sheet_names
#열을 추가할때는 행별로 기준이 같아야함(같은 날짜)

['a', 'b', 'c', 'd']

In [ ]:
data_a = data_excel.parse('a')
data_c = data_excel.parse('c')
#열을 붙일때도 콘켓

frames = [data_a,data_c]
pd.concat(frames, axis=1) #axis =0(default값 - 행을 기본적으로 붙임) 1(옆으로 데이터를 붙임)

#a1,c1이 12345를 가지고있음

   a1 a2     a3  c1  c2
0   1  a   1200   1  20
1   2  b   4500   2  40
2   3  c  10000   3  60
3   4  d   9600   4  30
4   5  e    150   5  20

In [ ]:
data_c.index = range(2,7)
data_c

   c1  c2
2   1  20
3   2  40
4   3  60
5   4  30
6   5  20

In [ ]:
frames = [data_a,data_c]
pd.concat(frames, axis=1)
#c의 인덱스를 23456으로 바꿔주니 변했음

    a1   a2       a3   c1    c2
0  1.0    a   1200.0  NaN   NaN
1  2.0    b   4500.0  NaN   NaN
2  3.0    c  10000.0  1.0  20.0
3  4.0    d   9600.0  2.0  40.0
4  5.0    e    150.0  3.0  60.0
5  NaN  NaN      NaN  4.0  30.0
6  NaN  NaN      NaN  5.0  20.0

In [ ]:
pd.concat(frames, axis=1,join='inner')
#겹치는것만 뽑아내라 join

   a1 a2     a3  c1  c2
2   3  c  10000   1  20
3   4  d   9600   2  40
4   5  e    150   3  60

pandas.merge()

join = inner outer left right

inner =  x에도 있고 y에도 있는 교집합

outer = 둘다 

left = x에있는거

right = y에 있음

In [ ]:
#inner_join
pd.merge(data_a, data_d, left_on='a1',right_on ='d1') #how default = innerjoin

In [ ]:
#outer_join
pd.merge(data_a, data_d, left_on='a1',right_on ='d1',how='outer')
#왼쪽에 있든 오른쪽에 있는 데이터를 다출력하고, 빈값은 missing value

In [ ]:
#left_join
pd.merge(data_a, data_d, left_on='a1',right_on ='d1',how='left')